#ifndef DEFS_H
#define DEFS_H

// Type declarations.  Should contain no function or extern data declarations.

#include <inttypes.h>

/* Creature types are in their own header because there are so many of them. */
#include "subtypes.h"

/* External enumerators for dynamic card ids. It's automatically generated by csv2dat.exe*/
#include "card_id.h"

/* Expansions */
#include "Expansions.h"

#ifndef PACKED
#define PACKED __attribute__((__packed__))
#endif

#ifdef SHANDALAR
#define STATIC_ASSERT(e, msg)	static_assert(e, #msg)
#else
#define STATIC_ASSERT(e, msg)	enum { static_assertion__##msg = 1/(e) }
#endif

#ifdef SHANDALAR
#define PRIVATE_IN_SHANDALAR(arg) private: arg public:
#else
#define PRIVATE_IN_SHANDALAR(arg) arg
#endif

/* Colors */
typedef enum
{
  COLOR_COLORLESS = 0,
  COLOR_BLACK     = 1,
  COLOR_BLUE      = 2,
  COLOR_GREEN     = 3,
  COLOR_RED       = 4,
  COLOR_WHITE     = 5,
  COLOR_ARTIFACT  = 6,
  COLOR_ANY       = 7
#ifdef SHANDALAR
  ,
  COLOR_HYBRID    = 7	// only valid in the context of pay_mana_xbugrwaU[]
#endif
} color_t;

/* Colors */
typedef enum
{
  COLOR_TEST_COLORLESS = 0x01,
  COLOR_TEST_BLACK     = 0x02,
  COLOR_TEST_BLUE      = 0x04,
  COLOR_TEST_GREEN     = 0x08,
  COLOR_TEST_RED       = 0x10,
  COLOR_TEST_WHITE     = 0x20,
  COLOR_TEST_ARTIFACT  = 0x40,
  COLOR_TEST_ANY_COLORED = COLOR_TEST_WHITE | COLOR_TEST_RED | COLOR_TEST_GREEN | COLOR_TEST_BLACK | COLOR_TEST_BLUE,
  COLOR_TEST_ANY       = COLOR_TEST_ANY_COLORED | COLOR_TEST_COLORLESS,

  XTRIGGER_REPLACE_KILL	= 0x01000B00,	// Shandalar only: sent when a non-effect card or token would go to graveyard or be exiled from the battlefield or stack, including a non-permanent card that was cast.  Happens before EVENT_GRAVEYARD_FROM_PLAY.  Sent only if ENABLE_XTRIGGER_REPLACE_KILL is set; trigger_cause_controller and trigger_cause are the dispatching card, and its kill_code will be accurate.  Set suppress_this_trigger=1 to abort the original kill_card - and you want to do that in essentially all cases of replacement.  Even in the special case of changing a go-to-graveyard to exile, kill the card again rather than setting kill_code.  You'll also need to remove STATUS_DYING in almost all cases.
  XTRIGGER_CARD_DRAWN	= 0x1000C00,	// Shandalar only: A card was drawn (and not replaced).  It's in {trigger_cause_controller, trigger_cause}.
  XTRIGGER_THIS_DIES	= 0x1000D00,	// Shandalar only: This isn't actually ever dispatched.  A card calling HAS_WHEN_THIS_DIES() will have TRIGGER_GRAVEYARD_FROM_PLAY translated into this and then forwarded to it after it's left the battlefield.
  XTRIGGER_LOSE_LIFE	= 0x1000E00,	// Shandalar only: Works exactly like TRIGGER_GAIN_LIFE - either a card must have EA_LICH, or it must be manually set in event_flags; and the amount of life lost is stored in life_gained (always a negative number here)
#endif
  XTRIGGER_1_1_COUNTERS		= 0x1000F00,	// One or more +1/+1 counters were placed on trigger_cause_controller/trigger_cause.  The number of counters is stored in counters_added. Dispatched only if ENABLE_XTRIGGER_1_1_COUNTERS is set.
  XTRIGGER_BECAME_RENOWNED	= 0x1001000,	// {trigger_cause_controller,trigger_cause} just became renowned.
} xtrigger_t;

/* Triggers, unlike events, are relatively computationally expensive.  Triggers that are rarely handled, particularly ones from things that would get dispatched
 * frequently or that would get dispatched several times in a row, shouldn't even be dispatched unless there's a card that can handle it in play.  Analagously
 * to the exe's event_flags, these need to be set in enable_xtrigger_flags by at least one card or the corresponding trigger won't be sent.  The canonical place
 * to do so is after EVENT_CHANGE_TYPE has been fully computed, but there's no event guaranteed to be sent then (doing it during EVENT_CHANGE_TYPE itself is too
 * early, since another card might still change event_result); setting the flag is fast enough that it can be done continuously in card functions. */
typedef enum
{
  ENABLE_XTRIGGER_REPLACE_MILL	= (1<<0),
  ENABLE_XTRIGGER_MILLED		= (1<<1),
  ENABLE_XTRIGGER_REPLACE_CARD_TO_GY_FROM_ANYWHERE_BUT_LIBRARY	= (1<<2),
  ENABLE_XTRIGGER_CARD_TO_GY_FROM_ANYWHERE_BUT_LIBRARY	= (1<<3),
#ifdef SHANDALAR
  ENABLE_XTRIGGER_REPLACE_KILL	= (1<<4),
  ENABLE_TRIGGER_REPLACE_CARD_DRAW	= (1<<5),	// sic
  ENABLE_XTRIGGER_CARD_DRAWN	= (1<<6),
  ENABLE_TRIGGER_BOUNCE_PERMANENT   = (1<<7),	// sic
#endif
  ENABLE_XTRIGGER_1_1_COUNTERS   = (1<<8),
} enable_xtrigger_flags_t;

typedef struct
{
  int internal_card_id;	// internal_card_id of the milled card
  int position;			// position of the milled card in graveyard; not necessarily still accurate
  int source;			// graveyard_source[] value of the milled card; always accurate
} milled_t;

#define IS_AI(p_) (ai_is_speculating == 1 || ((p_) == AI && !(trace_mode & 2)))

/* Resolve trigger options */
typedef enum
{
  // this_dies_trigger assumes this can fit into one byte
  RESOLVE_TRIGGER_OPTIONAL	= 1,
  RESOLVE_TRIGGER_MANDATORY	= 2,
  RESOLVE_TRIGGER_DUH		= 3,	/* Not recognized by the exe, which I hope is obvious.  Handled by a (very few) integrated trigger interfaces to mean
									 * "change to RESOLVE_TRIGGER_MANDATORY if duh_mode is on, otherwise RESOLVE_TRIGGER_OPTIONAL." */

// Nominally optional, but forced if you have duh mode on.  And now badly misnamed.
#define RESOLVE_TRIGGER_AI(p_)	(duh_mode(p_) ? RESOLVE_TRIGGER_MANDATORY : RESOLVE_TRIGGER_OPTIONAL)
#define RESOLVE_TRIGGER_CHECK_LIFE_TOTAL(p_, v_)	((duh_mode(p_) && life[p_]-v_ > 5)? RESOLVE_TRIGGER_MANDATORY : RESOLVE_TRIGGER_OPTIONAL)
#define RESOLVE_TRIGGER_CHECK_DECK_COUNT(p_, v_)	((duh_mode(p_) && count_deck(p_)-v_ > 10)? RESOLVE_TRIGGER_MANDATORY : RESOLVE_TRIGGER_OPTIONAL)

} resolve_trigger_t;

/* Modes for kill_card() */
typedef enum
{
  KILL_BURY      = 1,
  KILL_DESTROY   = 2,
  KILL_SACRIFICE = 3,
  KILL_REMOVE    = 4,
  // Some things use 5 for "bounce permanent" in places that normally hold a kill_t.  actions_t is one, but not the only one.
  KILL_STATE_BASED_ACTION = 17,	/* For things "put into the graveyard" as a result of state-based actions, rule 704; for example, a creature with 0 or less
								 * toughness, a planeswalker with 0 loyalty, planeswalker uniqueness/legend/enchant-world rules, Auras enchanting nothing or
								 * illegal targets.  kill_card() immediately translates this to KILL_SACRIFICE for kill_card_exe, so it'll show up as
								 * KILL_SACRIFICE in kill_code still; but it also sets SF_KILL_STATE_BASED_ACTION so things like It That Betrays don't trigger
								 * for it. */
} kill_t;

/* Modes for new_global_tutor(), reveal_top_cards_of_library_and_choose() */
typedef enum
{
  TUTOR_HAND    = 0,
  TUTOR_DECK    = 1,
  TUTOR_GRAVE   = 2,
  TUTOR_PLAY    = 3,	// Not valid for destination_rest parameter of reveal_top_cards_of_library_and_choose()
  TUTOR_PLAY_TAPPED		= 4,	// Not valid for destination_rest parameter of reveal_top_cards_of_library_and_choose()
  TUTOR_RFG				= 5,
  TUTOR_GET_ID			= 6,	// Not valid for destination_rest parameter of reveal_top_cards_of_library_and_choose()
  TUTOR_PLAY_ATTACKING  = 7,	// Not valid for destination_rest parameter of reveal_top_cards_of_library_and_choose()
  TUTOR_GET_POSITION    = 8,	// Not valid for destination_rest parameter of reveal_top_cards_of_library_and_choose()
  TUTOR_BOTTOM_OF_DECK  = 9,
  TUTOR_TPLAYER_HAND	= 10,
  TUTOR_BOTTOM_OF_DECK_RANDOM  = 11,	// Only valid for the destination_rest parameter of reveal_top_cards_of_library_and_choose()
} tutor_t;

typedef enum
{
  TUTOR_FROM_DECK	= 1,
  TUTOR_FROM_GRAVE	= 2,
  TUTOR_FROM_RFG	= 3,
  TUTOR_FROM_HAND	= 4,
  TUTOR_FROM_GRAVE_NOTARGET	= 5,	// just like TUTOR_FROM_GRAVE, but not affected by graveyard_has_shroud
} tutor_from_t;

/* Card States */
typedef enum
{
  STATE_JUST_DRAWED				= 0x1,
  STATE_IN_PLAY					= 0x2,	// If STATE_INVISIBLE also set, then on the stack and no longer interruptible.
  STATE_ATTACKING				= 0x4,
  STATE_BLOCKING				= 0x8,
  STATE_TAPPED					= 0x10,
  STATE_INVISIBLE				= 0x20, // Mok --> CAST_UNRESOLVED	On the stack.  If STATE_IN_PLAY also set, then no longer interruptible.
  STATE_ATTACKED				= 0x40, // Previously STATE_ATTACKING this turn, but no longer attacking
  STATE_JUST_CAST				= 0x80,
  STATE_PROCESSING				= 0x100,
  STATE_ISBLOCKED				= 0x200, // ??
  STATE_PLAYED_FROM_HAND		= 0x400, // Not what it says.
  STATE_UNKNOWN800				= 0x800,
  STATE_OWNED_BY_OPPONENT		= 0x1000,
  STATE_VIGILANCE				= 0x2000,	// Must be set continuously during EVENT_ABILITIES.
  STATE_BLOCKED					= 0x4000, // Previously STATE_BLOCKING this turn, but no longer blocking
  STATE_UNKNOWN8000				= 0x8000, // MUST_ATTACK ??
  STATE_SICKNESS				= 0x10000,	// Is not the same of the following, why ? - Doesn't exist in Manalink.  In Shandalar, this means "summon sick."
  STATE_SUMMON_SICK				= 0x20000,	// In Shandalar, only STATE_SICKNESS is added to the AI's permanents during speculation; for the human's permanents, and not during speculation, both are.
  STATE_NO_AUTO_TAPPING			= 0x40000,
  STATE_UNKNOWN80000			= 0x80000,
  STATE_CANNOT_TARGET			= 0x100000,
  STATE_TARGETTED				= 0x200000,
  STATE_POWER_STRUGGLE			= 0x400000,	// Seems to be set on control effects to indicate who should gain control when the effect goes away if damage_source_player/card is unset
  STATE_OUBLIETTED				= 0x800000, // Phased ??
  STATE_NONCREATURE_CAN_ATTACK	= 0x1000000,
  STATE_NONCREATURE_CAN_BLOCK	= 0x2000000,

  STATE_IS_TRIGGERING			= 0x10000000,
  STATE_DONT_RECOPY_ONTO_STACK	= 0x20000000,	// If set during EVENT_ACTIVATE, then don't copy the card back into its (already-existing) activation card on the stack.  Caller's responsibility to either update all relevant values there (per recopy_card_onto_stack), or simply not handle EVENT_RESOLVE_ACTIVATION.  Bit is removed when recopying is skipped.  Works only for activation, not casting.
} state_t;

// "status" for "token_status" in "card_instance"
typedef enum
{
  STATUS_HACKED				= 0x2,
  STATUS_SLEIGHTED			= 0x4,
  STATUS_OBLITERATED		= 0x8,
  STATUS_TOKEN				= 0x10,
  STATUS_PERMANENT			= 0x20,
  STATUS_ANIMATED			= 0x40,
  STATUS_DYING				= 0x80,
  STATUS_TIMEWALK			= 0x100,
  STATUS_WALL_CAN_ATTACK	= 0x800,	// Must be set continuously during EVENT_ABILITIES.
  STATUS_LEGACY_TYPECHANGE	= 0x1000,	// Unused by exe.  In Manalink, set during EVENT_CHANGE_TYPE when a card animates itself.
  STATUS_COLOR_FORCED		= 0x2000,
  STATUS_BERSERK			= 0x4000,
  STATUS_CANT_ATTACK		= 0x8000,	// Must be set continuously during EVENT_ABILITIES.
  STATUS_INVISIBLE_FX		= 0x10000,
  STATUS_RED_BORDER			= 0x20000,	// Draws a red border around the edge of smallcard, e.g. when assigning combat damage
  STATUS_COMBAT_DAMAGE		= 0x40000,
  STATUS_TRAMPLE_DAMAGE		= 0x80000,
  STATUS_FIRST_STRIKE_DAMAGE= 0x100000,
  STATUS_ISLAND_SANCTUARY	= 0x400000,
  STATUS_CANNOT_REGENERATE	= 0x800000,
  STATUS_CONTROLLED			= 0x1000000,
  STATUS_BASICLAND_DEPENDANT= 0x2000000,	// Alters displayed an effect card's main text for sleight and hack based on its source's current sleight/hack status, not its status when the effect card was created.  Set only with fx_asterisk in exe.
  STATUS_CANNOT_BE_DESTROYED= 0x4000000, // Indestructible ???
  STATUS_SPECIAL_BLOCKER	= 0x8000000,
  STATUS_CANNOT_LEAVE_PLAY	= 0x40000000
} status_t;

/* Card Types  */
typedef enum
{
  TYPE_NONE			= 0,
  TYPE_LAND			= 1 << 0,
  TYPE_CREATURE		= 1 << 1,
  TYPE_ENCHANTMENT	= 1 << 2,
  TYPE_SORCERY		= 1 << 3,
  TYPE_INSTANT		= 1 << 4,
  TYPE_INTERRUPT	= 1 << 5,
  TYPE_ARTIFACT		= 1 << 6,
  TYPE_EFFECT		= 1 << 7, // All legacy / effect cards
  TYPE_SPELL		= TYPE_SORCERY | TYPE_INSTANT | TYPE_INTERRUPT,
#ifndef SHANDALAR
  TYPE_PERMANENT	= TYPE_LAND | TYPE_CREATURE | TYPE_ENCHANTMENT | TYPE_ARTIFACT,
  TYPE_NONEFFECT	= TYPE_PERMANENT | TYPE_SPELL,
  TYPE_ANY			= TYPE_NONEFFECT | TYPE_EFFECT,
#endif
  // Valid only in targetting
  TARGET_TYPE_TOKEN					= 1 << 12,
  TARGET_TYPE_DAMAGE_LEGACY			= 1 << 13,	// Checked for but unused by exe
  TARGET_TYPE_HACK_SLEIGHT_LEGACY	= 1 << 14,	// Checked for but unused by exe
  TARGET_TYPE_DRAW_CARD_LEGACY		= 1 << 15,	// Checked for but unused by exe
  TARGET_TYPE_PLANESWALKER			= 1 << 16,	// Works for targetting, is_what(), and the make_test() family, but not much else.  All will also accept planeswalkers if all of land/creature/enchantment/artifact are set.
  TARGET_TYPE_NONCREATURE_CAN_BLOCK	= 1 << 25,
#ifdef SHANDALAR
  TYPE_PERMANENT	= TYPE_LAND | TYPE_CREATURE | TYPE_ENCHANTMENT | TYPE_ARTIFACT | TARGET_TYPE_PLANESWALKER,
  TYPE_NONEFFECT	= TYPE_PERMANENT | TYPE_SPELL,
  TYPE_ANY			= TYPE_NONEFFECT | TYPE_EFFECT,
#endif
} type_t;

/* Flags for boost_subtype(), boost_creature_type(), and boost_creature_by_color() */
typedef enum
{
  BCT_CONTROLLER_ONLY	= (1 << 0),
  BCT_INCLUDE_SELF		= (1 << 1),
  BCT_OPPONENT_ONLY		= (1 << 2),
  BCT_NO_SLEIGHT		= (1 << 3),	// don't sleight color choice in boost_creature_by_color()
} bct_t;

/* Static Abilities */
typedef enum
{
  KEYWORD_SWAMPWALK       = 1 <<  0,
  KEYWORD_ISLANDWALK      = 1 <<  1,
  KEYWORD_FORESTWALK      = 1 <<  2,
  KEYWORD_MOUNTAINWALK    = 1 <<  3,
  KEYWORD_PLAINSWALK      = 1 <<  4,
  KEYWORD_FLYING          = 1 <<  5,
  KEYWORD_BANDING         = 1 <<  6,
  KEYWORD_TRAMPLE         = 1 <<  7,
  KEYWORD_FIRST_STRIKE    = 1 <<  8,
  KEYWORD_REGENERATION    = 1 <<  9,
  KEYWORD_REACH           = 1 << 10,
  KEYWORD_PROT_BLACK      = 1 << 11,
  KEYWORD_PROT_BLUE       = 1 << 12,
  KEYWORD_PROT_GREEN      = 1 << 13,
  KEYWORD_PROT_RED        = 1 << 14,
  KEYWORD_PROT_WHITE      = 1 << 15,
  KEYWORD_PROT_ARTIFACTS  = 1 << 16,
  KEYWORD_SHROUD          = 1 << 17, /* Supposed to be prot. enchantments, someone has redefined it... */
  KEYWORD_PROT_INSTANTS   = 1 << 18,
  KEYWORD_PROT_INTERRUPTS = 1 << 19, // Actually, used for the "Changeling" ability
  KEYWORD_PROT_SORCERIES  = 1 << 20,
  KEYWORD_PROT_CREATURES  = 1 << 21, /* SkyMagic editor claims this is banding when attacking. Another double use? */
  KEYWORD_PROT_LANDS      = 1 << 22,
  KEYWORD_DEFENDER        = 1 << 23,
  KEYWORD_RECALC_CHANGE_TYPE=1<< 24,//0x1000000
  KEYWORD_RECALC_TOUGHNESS= 1 << 25,//0x2000000
  KEYWORD_RECALC_POWER    = 1 << 26,//0x4000000
  KEYWORD_RECALC_ABILITIES= 1 << 27,//0x8000000
  KEYWORD_RECALC_SET_COLOR= 1 << 28,//0x10000000
  KEYWORD_INFECT          = 1 << 29,// 0x20000000,	// Previously something else; I suspect fear.  Still checked in one place in the exe.
  KEYWORD_DOUBLE_STRIKE   = 1 << 30,//0x40000100,
/*
  1<<31 is apparently Murk Dwellers' pump-when-not-blocked ability.
*/
  KEYWORD_BASIC_LANDWALK  = KEYWORD_SWAMPWALK|KEYWORD_ISLANDWALK|KEYWORD_FORESTWALK|KEYWORD_MOUNTAINWALK|KEYWORD_PLAINSWALK,
  KEYWORD_PROT_COLORED    = KEYWORD_PROT_BLACK|KEYWORD_PROT_BLUE|KEYWORD_PROT_GREEN|KEYWORD_PROT_RED|KEYWORD_PROT_WHITE,
  KEYWORD_PRISTINE        = KEYWORD_PROT_COLORED|KEYWORD_PROT_ARTIFACTS,
  KEYWORD_RECALC_ALL      = KEYWORD_RECALC_CHANGE_TYPE|KEYWORD_RECALC_TOUGHNESS|KEYWORD_RECALC_POWER|KEYWORD_RECALC_ABILITIES|KEYWORD_RECALC_SET_COLOR,
  KEYWORD_NONABILITIES    = KEYWORD_RECALC_ALL|(1<<31),
} keyword_t;

// Special abilities
typedef enum
{
  SP_KEYWORD_FEAR            = 1<<0,
  SP_KEYWORD_LIFELINK        = 1<<1,
  SP_KEYWORD_HASTE           = 1<<2,
  SP_KEYWORD_VIGILANCE       = 1<<3,
  SP_KEYWORD_UNBLOCKABLE     = 1<<4,
  SP_KEYWORD_CANNOT_BLOCK    = 1<<5,
  //SP_KEYWORD_INFECT          = 1<<6,	// unused
  //SP_KEYWORD_CANNOT_ATTACK   = 1<<7,	// unused
  SP_KEYWORD_SHADOW          = 1<<8,
  SP_KEYWORD_DEATHTOUCH      = 1<<9,
  SP_KEYWORD_MUST_ATTACK	 = 1<<10,	// must be called continuously
  SP_KEYWORD_INDESTRUCTIBLE	 = 1<<11,	// can't be added by bit; must be called continuously
  SP_KEYWORD_MUST_BE_BLOCKED = 1<<12,	// must be called continuously
  SP_KEYWORD_FLANKING		 = 1<<13,	// must be called continuously
  SP_KEYWORD_WITHER			 = 1<<14,
  SP_KEYWORD_BUSHIDO		 = 1<<15,	// can't be added by bit; must be called continuously
  //SP_KEYWORD_WILL_DEAL_DOUBLE_DAMAGE	= 1<<16,	// unused
  //SP_KEYWORD_WILL_RECEIVE_DOUBLE_DAMAGE	= 1<<17,	// unused
  SP_KEYWORD_CANNON_FODDER				= 1<<18,	// doesn't belong here; can't be added by bit
  //SP_KEYWORD_DEFENDER					= 1<<19,	// unused
  SP_KEYWORD_RFG_WHEN_DAMAGE			= 1<<20,	// can't be added by bit
  //SP_KEYWORD_NEGATE_ABILITY				= 1<<21,	// unused
  SP_KEYWORD_LURE						= 1<<22,	// must be called continuously
  SP_KEYWORD_HEXPROOF					= 1<<23,
  SP_KEYWORD_FREEZE_WHEN_DAMAGE			= 1<<24,	// can't be added by bit; must be called continuously
  SP_KEYWORD_INTIMIDATE					= 1<<25,
  SP_KEYWORD_MUST_BLOCK					= 1<<26,	// must be called continuously
  SP_KEYWORD_SHADOW_HOSER				= 1<<27,
  SP_KEYWORD_DIE_AT_EOT					= 1<<28,	// doesn't belong here
//  SP_KEYWORD_PERSIST					= 1<<29,	// unused
  SP_KEYWORD_HORSEMANSHIP				= 1<<30,
  SP_KEYWORD_DOES_NOT_END_AT_EOT		= 1<<31,
} sp_keyword_t;

/* Phases of turn */
typedef enum
{
  PHASE_START				=  0x0,
  PHASE_UNTAP				=  0x1,
  PHASE_BEGIN_UPKEEP		=  0x2,
  PHASE_UNKOWN3				=  0x3,
  PHASE_UPKEEP				=  0x4,
  PHASE_UNKOWN5				=  0x5,
  PHASE_DRAW				=  0xA,
  PHASE_MAIN1				= 0x14,
  PHASE_DECLARE_ATTACKERS	= 0x15,
  PHASE_BEFORE_BLOCKING		= 0x16,
  PHASE_DECLARE_BLOCKERS	= 0x17,
  PHASE_AFTER_BLOCKING		= 0x18,
  PHASE_FIRST_STRIKE_DAMAGE	= 0x19,
  PHASE_NORMAL_COMBAT_DAMAGE= 0x1A,
  PHASE_NORMAL_COMBAT_DAMAG2= 0x1B,
  PHASE_MAIN2				= 0x1E,
  PHASE_DISCARD				= 0x1F,
  PHASE_CLEANUP2			= 0x20,
  PHASE_UNKNOWN21			= 0x21,
  PHASE_CLEANUP				= 0x22,
  PHASE_DAMAGE_PREVENTION	= 0x25,
} phase_t;

typedef struct target_struct
{
  int32_t player;
  int32_t card;
} target_t;

typedef enum {
	// Only one byte wide, and they must be properly additive, since other effects may set additional bits.

	// Send an EVENT_CHECK_DESTROY_IF_BLOCKED to find out.  Set event_result=1 within handler to indicate destruction.
	DIFB_ASK_CARD		= 0x1,	/* sends EVENT_CHECK_DESTROY_IF_BLOCKED only to the card being checked, with (affected_card_controller,affected_card) the card
								 * being checked and attacking_player/attacking_card the other card (whether it's actually the attacker or blocker) */
	DIFB_ASK_ALL_CARDS	= 0x2,	/* sends EVENT_CHECK_DESTROY_IF_BLOCKED to all cards, setting affected_card_controller, affected_card, attacking_player, and
								 * attacking_card as above.  Overrides DIFB_ASK_CARD.  Avoid if possible. */

	// Static checks.
	DIFB_DESTROYS_NONWALLS		= 0x4,	/* Destroys any non-Wall creatures that block or are blocked by this card.  (To get just one or the other, set
										 * destroys_if_blocked only during the appropriate turn.) */
	DIFB_DESTROYS_WALLS			= 0x8,	// Destroys any Wall creatures that block or are blocked by this card.
	DIFB_DESTROYS_ALL			= (DIFB_DESTROYS_NONWALLS|DIFB_DESTROYS_WALLS),	// Destroys all creatures that block or are blocked by this card.
	DIFB_DESTROYS_UNPROTECTED	= 0x10,	/* Destroys all creatures that can be damaged by this.  Mostly suitable for deathtouch, though it makes the AI think
										 * that blocking/being blocked causes destruction, not that the deathtouch creature must damage to destroy. */
} destroys_if_blocked_t;

// Counter indices.
#ifdef SHANDALAR
enum counter_t: uint8_t
#else
typedef enum
#endif
{
	COUNTER_P1_P1		= 0,
	COUNTER_M1_M1		= 1,
	COUNTER_P0_P1		= 2,
	COUNTER_P0_P2		= 3,
	COUNTER_P1_P0		= 4,
	COUNTER_P1_P2		= 5,
	COUNTER_P2_P0		= 6,
	COUNTER_P2_P2		= 7,
	COUNTER_M0_M1		= 8,
	COUNTER_M0_M2		= 9,
	COUNTER_M1_M0		= 10,
	COUNTER_M2_M1		= 11,

	COUNTER_M2_M2		= 12,
	COUNTER_AGE			= 13,
	COUNTER_AIM			= 14,
	COUNTER_ARROW		= 15,
	COUNTER_ARROWHEAD	= 16,
	COUNTER_AWAKENING	= 17,
	COUNTER_BLAZE		= 18,
	COUNTER_BLOOD		= 19,
	COUNTER_BOUNTY		= 20,
	COUNTER_BRIBERY		= 21,
	COUNTER_CARRION		= 22,
	COUNTER_CHIP		= 23,

	COUNTER_CORPSE		= 24,
	COUNTER_CREDIT		= 25,
	COUNTER_CUBE		= 26,
	COUNTER_CURRENCY	= 27,
	COUNTER_DEATH		= 28,
	COUNTER_DELAY		= 29,
	COUNTER_DEPLETION	= 30,
	COUNTER_DESPAIR		= 31,
	COUNTER_DEVOTION	= 32,
	COUNTER_DIVINITY	= 33,
	COUNTER_DOOM		= 34,
	COUNTER_DREAM		= 35,

	COUNTER_ECHO		= 36,
	COUNTER_ELIXIR		= 37,
	COUNTER_ENERGY		= 38,
	COUNTER_EON			= 39,
	COUNTER_EYEBALL		= 40,
	COUNTER_FADE		= 41,
	COUNTER_FATE		= 42,
	COUNTER_FEATHER		= 43,
	COUNTER_FILIBUSTER	= 44,
	COUNTER_FLAME		= 45,
	COUNTER_FLOOD		= 46,
	COUNTER_FUNGUS		= 47,

	COUNTER_FUNK		= 48,
	COUNTER_FUSE		= 49,
	COUNTER_GLYPH		= 50,
	COUNTER_GOLD		= 51,
	COUNTER_GROWTH		= 52,
	COUNTER_HATCHLING	= 53,
	COUNTER_HEALING		= 54,
	COUNTER_HOOFPRINT	= 55,
	COUNTER_HOURGLASS	= 56,
	COUNTER_HUNGER		= 57,
	COUNTER_HUSK		= 58,
	COUNTER_ICE			= 59,

	COUNTER_INFECTION	= 60,
	COUNTER_INTERVENTION= 61,
	COUNTER_JAVELIN		= 62,
	COUNTER_KI			= 63,
	COUNTER_LEVEL		= 64,
	COUNTER_LORE		= 65,
	COUNTER_LOYALTY		= 66,
	COUNTER_LUCK		= 67,
	COUNTER_MAGNET		= 68,
	COUNTER_MANIFESTATION	= 69,
	COUNTER_MANNEQUIN	= 70,
	COUNTER_MATRIX		= 71,

	COUNTER_MINE		= 72,
	COUNTER_MINING		= 73,
	COUNTER_MIRE		= 74,
	COUNTER_MUSIC		= 75,
	COUNTER_MUSTER		= 76,
	COUNTER_NET			= 77,
	COUNTER_OMEN		= 78,
	COUNTER_ORE			= 79,
	COUNTER_PAGE		= 80,
	COUNTER_PAIN		= 81,
	COUNTER_PARALYZATION= 82,
	COUNTER_PETAL		= 83,

	COUNTER_PETRIFICATION	= 84,
	COUNTER_PHYLACTERY	= 85,
	COUNTER_PIN			= 86,
	COUNTER_PLAGUE		= 87,
	COUNTER_POLYP		= 88,
	COUNTER_POP			= 89,
	COUNTER_PRESSURE	= 90,
	COUNTER_PUPA		= 91,
	COUNTER_QUEST		= 92,
	COUNTER_RUST		= 93,
	COUNTER_SCREAM		= 94,
	COUNTER_SCROLL		= 95,

	COUNTER_SHELL		= 96,
	COUNTER_SHIELD		= 97,
	COUNTER_SHOE		= 98,
	COUNTER_SHRED		= 99,
	COUNTER_SLEEP		= 100,
	COUNTER_SLEIGHT		= 101,
	COUNTER_SLIME		= 102,
	COUNTER_SOOT		= 103,
	COUNTER_SPORE		= 104,
	COUNTER_STORAGE		= 105,
	COUNTER_STRIFE		= 106,
	COUNTER_STUDY		= 107,

	COUNTER_THEFT		= 108,
	COUNTER_THIRD_DEGREE_BURN	= 109,
	COUNTER_TIDE		= 110,
	COUNTER_TIME		= 111,
	COUNTER_TOWER		= 112,
	COUNTER_TRAINING	= 113,
	COUNTER_TRAP		= 114,
	COUNTER_TREASURE	= 115,
	COUNTER_VELOCITY	= 116,
	COUNTER_VERSE		= 117,
	COUNTER_VITALITY	= 118,
	COUNTER_WAGE		= 119,

	COUNTER_WINCH		= 120,
	COUNTER_WIND		= 121,
	COUNTER_WISH		= 122,
	COUNTER_CHARGE		= 123,
	COUNTER_CRYSTAL		= 124,
	COUNTER_GEM			= 125,
	COUNTER_ISOLATION	= 126,

	// Updates need to be mirrored in Text.res:CUECARD_COUNTERS_SPECIAL; the final entry for COUNTER_end should just be "Counters"

	COUNTER_end,
	COUNTER_invalid		= 255,
#ifndef SHANDALAR
} counter_t;
#else
};
STATIC_ASSERT(sizeof(counter_t) == 1, counter_t_wrong_size);
#endif

#ifdef SHANDALAR
struct card_instance_struct;
struct csvid_t;

struct iid_t
{
	iid_t(void)	{}
	explicit iid_t(int raw_val): raw(raw_val)	{}
	explicit iid_t(uint16_t raw_val): raw(raw_val == 0xFFFF ? -1 : (int)raw_val)	{}
	explicit iid_t(uint32_t raw_val): raw(raw_val)	{}
	explicit iid_t(const card_instance_struct* inst);
	iid_t(int player, int card);
	explicit iid_t(target_struct t);
	explicit iid_t(csvid_t t);

	iid_t& operator++(void)	{ ++raw;	return *this; }

	bool ok(void) const		{ return raw >= 0; }
	csvid_t csvid(void) const;

	int raw;
};

struct csvid_t
{
	csvid_t(void) {}
	/*implicit*/ csvid_t(card_id_t id): raw(id)	{}
	explicit csvid_t(int raw_val): raw(raw_val)	{}
	explicit csvid_t(uint32_t raw_val): raw(raw_val)	{}
	explicit csvid_t(uint16_t raw_val): raw(raw_val == 0xFFFF ? -1 : (int)raw_val)	{}
	explicit csvid_t(const card_instance_struct* inst);
	csvid_t(int player, int card);
	explicit csvid_t(target_struct t);
	explicit csvid_t(iid_t t);

	bool ok(void) const		{ return raw >= 0; }
	iid_t iid(void) const;

	int raw;
};
#endif

#ifdef SHANDALAR
struct card_aux_t;
#endif

/* Info struct */
typedef struct card_instance_struct
{
  /* some values might be padding */
  uint8_t	special_counters;	/*  0x00 */
  uint8_t	counters2;			/*  0x01 */	// Originally -0/-2 counters from Spirit Shackle
  uint8_t	counters3;			/*  0x02 */	// Originally -1/-1 counters from Unstable Mutation
  uint8_t	counters4;			/*  0x03 */	// Originally -0/-1 counters
  int32_t	damage_target_card;	/*  0x04 */	// Card this aura or effect card is attached to.
  uint32_t	state;				/*  0x08 */
  int8_t	damage_source_player;	/*  0x0C */ //  int32_t  damage_source_player;
  int8_t	unused0;			/*  0x0D */	// Shandalar: untouched
  int16_t	toughness;			/*  0x0E */
  uint16_t	damage_on_card;		/*  0x10 */
  int16_t	counter_power;		/*  0x12 */
  uint32_t	unknown0x14;		/*  0x14 */	// activating trigger
  uint32_t	token_status;		/*  0x18 */
  int16_t	counter_toughness;	/*  0x1C */
  PRIVATE_IN_SHANDALAR(int8_t	color;)				/*  0x1E */
  int8_t	destroys_if_blocked;/*  0x1F */	/* Formerly enemy_against_color.  Uses values in destroys_if_blocked_t.  Set to 0 at the start of EVENT_CHANGE_TYPE, and should be reset in response.  AI hinting only. */
  int32_t	dummy3;				/*  0x20 */	// A dynamically-created internal_card_id stored here on a card in play, or in internal_card_id in any card, won't get reaped in end_turn_phase()
  uint8_t	blocking;			/*  0x24 */	// Banding id, if attacking
  PRIVATE_IN_SHANDALAR(int8_t	initial_color;)		/*  0x25 */	// Shandalar: untouched
  int16_t	unused0x26;			/*  0x26 */	// Exe version of rampage() uses this as temporary storage. (!)  That's no longer called, and the data's otherwise entirely untouched.  Shandalar: untouched
  uint32_t	regen_status;		/*  0x28 */	// Keywords.
#ifdef SHANDALAR
  card_aux_t* aux;
  uint32_t	unused30;
#else
  uint8_t	mana_to_untap[8];	/*  0x2C */	// No longer used in Manalink, but still read by the exe in one place and still written in one place.  To reclaim, make check_untap_payment() just return 0, and rewrite setup_upkeep_costs_and_set_untap_cost() to not touch it.
#endif
  int16_t	power;				/*  0x34 */
  uint8_t	number_of_targets;	/*  0x36 */
  uint8_t	unknown0x37;		/*  0x37 */	// Used only on damage cards, apparently for temporary storage
  int32_t	info_slot;			/*  0x38 */
  PRIVATE_IN_SHANDALAR(uint32_t	original_internal_card_id;)	/*  0x3C */ // Mok : CD_CardIDinCT_Parent
  uint8_t	color_id[6];		/*  0x40 */ // cless -> black -> blue -> green -> red -> white - Sleight of Mind data
  PRIVATE_IN_SHANDALAR(uint16_t	backup_internal_card_id;)	/*  0x46 */ // internal_card_id is stored here at the end of EVENT_CHANGE_TYPE.  A crutch to deal with the poor design decision of setting internal_card_id == -1 to indicate a card's left play.
  int32_t	damage_source_card;	/*  0x48 */ /* damage source card */
#ifndef SHANDALAR
  uint32_t	eot_toughness;		/*  0x4C */	// Bytes 0 and 1 manipulate text-modifiers on csvid=903 effect cards; otherwise reserved for individual card use.
#else
  union {
	  uint32_t eot_toughness;
	  struct {
		  uint8_t eot_toughness0;
		  uint8_t eot_toughness1;
		  uint8_t eot_toughness2;
		  uint8_t eot_toughness3;
	  };
  };
#endif
  int8_t	damage_target_player;	/*  0x50 */	// Player of card this aura or effect card is attached to.
#ifdef SHANDALAR
  counter_t special_counter_type;
  counter_t counter2_type;
  counter_t counter3_type;
#else
  uint8_t	special_counter_type;	/*  0x51 */
  uint8_t	unk52;				/*  0x52 */	// Entirely untouched by exe.
  uint8_t	unk53;				/*  0x53 */	// Entirely untouched by exe.
#endif
  uint32_t	timestamp;			/*  0x54 */
  PRIVATE_IN_SHANDALAR(uint8_t	mana_color;)			/*  0x58 */
#ifdef SHANDALAR
  counter_t counter4_type;
  counter_t counter5_type;
  counter_t counter6_type;
#else
  uint8_t	card_color;			/*  0x59 */
  uint8_t	unk5a;				/*  0x5A */
  uint8_t	unk5b;				/*  0x5B */
#endif
  uint32_t	upkeep_flags;		/*  0x5C */	// Eventual candidate for reclamation.  Used in: Curse Artifact, Mishra's War Machine, Brass Man, Colossus of Sardia, Elder Spawn, Cyclone, 0x434040, 0x435b50, 0x436740, 0x437620, 0x437670, Copper Tablet, Mana Crypt, Ghazban Ogre, Serendib Djinn, Juzam Djinn, Yawgmoth Demon, 0x475a30, 0x476b90, 0x477410, Feedback, Power Leak, Energy Flux, Erosion, Cursed Land, Karma, Sunken City, Stasis, Magnetic Mountain, Power Surge, Wanderlust, Unstable Mutation, Warp Artifact, Power Struggle, Conversion, Junun Efreet, Phantasmal Forces, Force of Nature, Cosmic Horror, Lord of the Pit, 0x4d9a30.
  int32_t	attack_rating;		/*  0x60 */
  PRIVATE_IN_SHANDALAR(uint16_t	display_pic_int_id;)	/*  0x64 */
  uint16_t	display_pic_num;	/*  0x66 */
  uint8_t	kill_code;			/*  0x68 */
#ifdef SHANDALAR
  counter_t counter7_type;
  uint8_t	counters6;
  uint8_t	counters7;
#else
  uint8_t	unk69;				/*  0x69 */	// Entirely untouched by exe.
  uint8_t	unk6A;				/*  0x6A */	// Entirely untouched by exe.
  uint8_t	unk6B;				/*  0x6B */	// Entirely untouched by exe.
#endif
  PRIVATE_IN_SHANDALAR(int32_t	internal_card_id;)	/*  0x6C */	// a csvid, not an internal_card_id, despite the misnaming
  uint32_t	unknown0x70;		/*  0x70 */ /* activateability */
  target_t	targets[19];		/*  0x74 */
  int32_t	parent_controller;	/* 0x10C */
  int32_t	parent_card;		/* 0x110 */
  int8_t	hack_mode[6];		/* 0x114 */ // colorless -> black -> blue -> green->red -> white
  uint16_t	unknown0x11a;		/* 0x11A */	// originally -2/-1 counters and +1/+2 counters	Shandalar: untouched
  uint32_t	untap_status;		/* 0x11C */	// Only bits 1 and 2 are used by the exe; but the whole dword is cleared in untap_phase().
  uint8_t	counters;			/* 0x120 */	// originally +1/+1 counters from Dwarven Weaponsmith
  uint8_t	counters5;			/* 0x121 */	// originally +1/+1 counters from Ashnod's Transmogrant
  uint16_t	unknown0x122;		/* 0x122 */	// originally +0/+1 and +2/+2 counters
  uint8_t	upkeep_colorless;	/* 0x124 */	// These seven bytes are strong candidates for reclamation.  Used in: 0x402B60, 0x437670, Energy Flux, Sunken City, Stasis, Conversion, Junun Efreet, Phantasmal Force, Force of Nature, Cosmic Horror
  uint8_t	upkeep_black;		/* 0x125 */
  uint8_t	upkeep_blue;		/* 0x126 */
  uint8_t	upkeep_green;		/* 0x127 */
  uint8_t	upkeep_red;			/* 0x128 */
  uint8_t	upkeep_white;		/* 0x129 */
  uint8_t	upkeep_artmana;		/* 0x12A */
  uint8_t	counters_m1m1;		/* 0x12B */	// Shandalar: untouched
#ifdef SHANDALAR	// strongly-typed accessors
  iid_t original_iid(void) const				{ return iid_t(original_internal_card_id); }
  void set_original_iid(iid_t iid_val)			{ original_internal_card_id = iid_val.raw; }
  csvid_t display_pic_csvid(void) const			{ return csvid_t(display_pic_int_id); }
  void set_display_pic_csvid(csvid_t csvid_val)	{ display_pic_int_id = csvid_val.raw & 0xFFFF; }
  iid_t backup_iid(void) const					{ return iid_t(backup_internal_card_id); }
  void set_backup_iid(iid_t iid_val)			{ backup_internal_card_id = iid_val.raw & 0xFFFF; }
  iid_t cur_iid(void) const						{ return iid_t(internal_card_id); }
  void set_cur_iid(iid_t iid_val)				{ internal_card_id = iid_val.raw; }
  iid_t iid(void) const							{ iid_t id{internal_card_id};	if (!id.ok()) id = iid_t(backup_internal_card_id);	return id; }

  keyword2_t keywords2(void) const;
  void set_keywords2(keyword2_t kw2_val);
  void add_keywords2(keyword2_t kw2_val);
  void remove_keywords2(keyword2_t kw2_val);

  instance_flags_t flags(void) const			{ return (instance_flags_t)(uint8_t)initial_color; }
  void set_flags(instance_flags_t if_val)		{ initial_color = (int8_t)(uint8_t)if_val; }
  void add_flags(instance_flags_t if_val)		{ initial_color |= (int8_t)(uint8_t)if_val; }
  void remove_flags(instance_flags_t if_val)	{ initial_color &= ~(int8_t)(uint8_t)if_val; }

  // Conveniences.  "(inst->damage_target_player, inst->damage_target_card)" is too verbose.
  target_t attached_to(void) const				{ return {damage_target_player, damage_target_card}; }
  bool attached_to(target_t t) const			{ return damage_target_card == t.card && damage_target_player == t.player; }
  bool attached_to(int p, int c) const			{ return damage_target_card == c && damage_target_player == p; }
  card_instance_struct* attached_to_inst(void) const;	// get_card_instance(attached_to())
  bool attached_to(type_t typ) const;			// damage_target_card >= 0 && damage_target_player >= 0 && (type(attached_to()) & typ)
  void attach_to(int p, int c)					{ damage_target_player = p;	damage_target_card = c; }
  void attach_to(target_t t)					{ attach_to(t.player, t.card); }

  target_t damage_source(void) const			{ return {damage_source_player, damage_source_card}; }
  bool damage_source(target_t t) const			{ return damage_source_card == t.card && damage_source_player == t.player; }
  bool damage_source(int p, int c) const		{ return damage_source_card == c && damage_source_player == p; }
  card_instance_struct* damage_source_inst(void) const;	// get_card_instance(damage_source())

  target_t parent(void) const					{ return {parent_controller, parent_card}; }
  bool parent(target_t t) const					{ return parent_card == t.card && parent_controller == t.player; }
  bool parent(int p, int c) const				{ return parent_card == c && parent_controller == p; }
  card_instance_struct* parent_inst(void) const;	// get_card_instance(parent())

  color_test_t colors(void) const				{ return static_cast<color_test_t>(static_cast<uint8_t>(color)); }
  color_test_t set_colors(color_test_t val)		{ return static_cast<color_test_t>(static_cast<uint8_t>(color = val)); }

  color_test_t mana_colors(void) const			{ return static_cast<color_test_t>(mana_color); }
  color_test_t set_mana_colors(color_test_t val){ return static_cast<color_test_t>(mana_color = val); }
#endif
} PACKED card_instance_t;

/* Data struct */
typedef struct
{
  uint8_t	secret;
  char		name[18];       /* 0x01 */
  uint8_t	reserved1[17];
  PRIVATE_IN_SHANDALAR(uint16_t	id;)	/* 0x24 */
  uint16_t	reserved2;
  uint8_t	type;	// ct_all.csv:Type:Effect..Type::Land
  uint8_t	subtype;	// ct_all.csv:Family
  PRIVATE_IN_SHANDALAR(uint8_t	color;)	// ct_all.csv:Color Unused..Color Colorless
/*
  uint8_t  cc[3];
  uint16_t power;
  uint16_t toughness;
  uint16_t reserved3;
*/
  uint8_t	cc[3];	// 0:colored mana, 1:colorless mana, 2:flags
  int16_t	power;
  int16_t	toughness;
  uint8_t	new_field;	//ct_all.csv:Extra Flags (Unused)..Modifies Casting Cost
  uint8_t	reserved3;	//ct_all.csv:Unused (next to Code Address)
  uint32_t	code_pointer;
  uint32_t	static_ability;	//ct_all.csv:Ability:Unknown..Ability:Swampwalk
  uint32_t	extra_ability;	//ct_all.csv:Flags:Play Cost..Flags:Activate
  uint8_t	rarity; // unused in current Manalink
  uint8_t	act_phases;	//ct_all.csv:Activate after Combat..Play before Combat
  uint8_t	expansion; // unused in current Manalink
  uint8_t	creature_rating;	// only -2 through 3 are accepted by ct2exe
  uint8_t	reserved4[4];
#ifdef SHANDALAR
  csvid_t csvid(void) const			{ return csvid_t(id); }
  void set_csvid(csvid_t csvid_val)	{ id = csvid_val.raw & 0xFFFF; }

  color_test_t colors(void) const				{ return static_cast<color_test_t>(color); }
  color_test_t set_colors(color_test_t val)		{ return static_cast<color_test_t>(color = val); }
#endif
} PACKED card_data_t;

typedef enum
{
	UPKEEP_UPKEEP_TRIGGER		= 0x001,
	UPKEEP_UPKEEP_BURY_IF_UNPAID= 0x002,
	UPKEEP_UPKEEP_DONE			= 0x004,
	UPKEEP_UPKEEP_CANTPAY		= 0x008,
	UPKEEP_UNTAP_TRIGGER		= 0x010,
	UPKEEP_UNTAP_PAID			= 0x040,
	UPKEEP_UNTAP_DONE			= 0x080,
	UPKEEP_UPKEEP_NODIALOG		= 0x100,
	UPKEEP_UPKEEP_UNPAID		= 0x200,
} upkeep_flags_t;

typedef enum
{
	ACT_PHASE_PLAY_BEFORE_COMBAT		= 0x1,
	ACT_PHASE_PLAY_BEFORE_BLOCKERS		= 0x2,
	ACT_PHASE_PLAY_AFTER_BLOCKERS		= 0x4,
	ACT_PHASE_PLAY_AFTER_COMBAT			= 0x8,
	ACT_PHASE_PLAY_ALL					= 0xF,
	ACT_PHASE_ACTIVATE_BEFORE_COMBAT	= 0x10,
	ACT_PHASE_ACTIVATE_BEFORE_BLOCKERS	= 0x20,
	ACT_PHASE_ACTIVATE_AFTER_BLOCKERS	= 0x40,
	ACT_PHASE_ACTIVATE_AFTER_COMBAT		= 0x80,
	ACT_PHASE_ACTIVATE_ALL				= 0xF0,
} act_phases_t;

/* Known values for "subtype / family" in card_data */
typedef enum
{
	// default			= -1
	SUB_WALL			= 0, //if a creature has this value set, it could attack only if enchanted by "Animate Wall" or if "Rolling Stones" are in play.
	SUB_MERFOLK			= 1,
	SUB_ZOMBIE			= 2,
	SUB_GOBLIN			= 3,
	SUB_DWARF			= 4,
	SUB_EFREET			= 5,
	SUB_DJINN			= 6,
	SUB_RAT				= 8,	// Also Urza lands
	SUB_ARTIFACT_LAND	= 9,
	SUB_ELEPHANT		= 10,
	SUB_MAMMOTH			= 11,
	SUB_DUAL_LAND		= 12, //(if a land does not have this value, it won't be animated by cards like Living Lands and Kormus Bell)
	SUB_BASIC_LAND		= 13, //(It's used ONLY for the 5 basic lands)
	SUB_LEGENDARY		= 14,
	SUB_LEGENDARY_LAND	= 15,
	SUB_ENCHANT_WORLD	= 16,
} subtype_in_card_data_t;

/* Extra ability is cards_data */
typedef enum
{
	EA_ACT_ABILITY		= 0x1,
	EA_ACT_INTERRUPT	= 0x2,
	EA_PROTECT			= 0x4,
	EA_INF_POWER		= 0x8,
	EA_INF_TOUGHNESS	= 0x10,
	EA_COUNTERS			= 0x20,
	EA_UNK40			= 0x40,		// copper tablet/disrupting scepter
	EA_UNK80			= 0x80,		// Shandalar: more expensive?
	EA_UNK100			= 0x100,	// Shandalar: card may be put in a dungeon; not selectable in cardpicker
	EA_UNK200			= 0x200,	// Shandalar: double cost?
	EA_UNK400			= 0x400,	// Shandalar: rarer?  Lich, most Arabian Nights and Antiquities cards
	EA_UNK800			= 0x800,	// Shandalar: card not selectable in cardpicker.  Unclear if this is its primary function or a side effect.
	EA_MANA_SOURCE		= 0x1000,
	EA_INTERRUPT		= 0x2000,
	EA_UNK4000			= 0x4000,	// Interrupt effects
	EA_BECAME_CREATURE	= 0x8000,
	EA_PAID_MANASOURCE	= 0x10000,
	EA_ACT_USE_X		= 0x20000,

	// The following bits, up to and including EA_CONTROLLED, are set in event_flags at the end of get_abilities(...EVENT_CHANGE_TYPE).
	EA_MARTYR			= 0x40000,	// Veteran Bodyguard-like effects
	EA_SELECT_ATTACK	= 0x80000,
	EA_SELECT_BLOCK		= 0x100000,
	EA_LICH				= 0x200000,
	EA_PAID_ATTACK		= 0x400000,
	EA_PAID_BLOCK		= 0x800000,
	EA_FORCE_ATTACK		= 0x1000000,
	EA_BEFORE_COMBAT	= 0x2000000,
	EA_DECLARE_ATTACK	= 0x4000000,
	EA_FELLWAR_STONE	= 0x8000000,
	EA_CONTROLLED		= 0x10000000,	// EVENT_CARDCONTROLLED is only sent if there's at least one card in play with this set
	// End of bits checked in event_flags.

	EA_UNK20000000		= 0x20000000,	// Completely unused.
#ifndef SHANDALAR
	EA_PLAY_COST		= 0x40000000,	// If set, this specific card receives EVENT_MODIFY_COST_GLOBAL events to change other spells' casting costs.
#else
	EA_MODIFY_COST_GLOBAL=0x40000000,	// In Shandalar, EVENT_MODIFY_COST_GLOBAL is sent to all cards if any on the bf have this bit set.  Like EA_MARTYR - EA_CONTROLLED, it's set in event_flags at the end of get_abilities(...EVENT_CHANGE_TYPE).
#endif
	EA_ABILITY_COST		= 0x80000000,
} extra_abilities_t;

#ifdef SHANDALAR
enum mana_flags_t: uint8_t
{
	MANA_0							= 0,
	MANA_SPEND_ONLY_BLACK_MANA_ON_X	= 0x1,
};
STATIC_ASSERT(sizeof(mana_flags_t) == 1, mana_flags_t_enum_wrong_size);
#endif

typedef enum
{
  CP_COLOR_LESS		= 0,
  CP_COLOR_BLACK	= 1,
  CP_COLOR_BLUE		= 2,
  CP_COLOR_ARTIFACT	= 3,
  CP_COLOR_MULTI	= 4,
  CP_COLOR_GREEN	= 5,
  CP_COLOR_LAND		= 6,
  CP_COLOR_RED		= 7,
  CP_COLOR_WHITE	= 8,
  CP_COLOR_SPECIAL	= -1
} CardPtrClr;

typedef enum
{
  CP_TYPE_NONE			= 0,
  CP_TYPE_ARTIFACT		= 1,
  CP_TYPE_ENCHANTMENT	= 2,
  CP_TYPE_INSTANT		= 3,
  CP_TYPE_INTERRUPT		= 4,
  CP_TYPE_LAND			= 5,
  CP_TYPE_SORCERY		= 6,
  CP_TYPE_CREATURE		= 7,
  CP_TYPE_TOKEN			= 8,
  CP_TYPE_PLANESWALKER	= 9,	// unused
  CP_TYPE_SCHEME		= 10,	// unused
  CP_TYPE_PLANE			= 11	// unused
} CardPtrType;

/* Data struct */
typedef struct
{
	PRIVATE_IN_SHANDALAR(uint32_t id;)
	char*    full_name;
	char*    name;
	uint32_t expansion;
	uint32_t color;		// 1:black 2:blue 3:artifact 4:gold 5:green 6:land 7:red 8:white
	uint32_t card_type;	// 1:artifact 2:enchantment 3:instant 4:interrupt 5:land 6:sorcery 7:creature 8:token
	uint16_t subtype1; /* 0x18 == 24 */
	uint16_t subtype2;
	const char* type_text;	// e.g. "Legendary Creature - Human"
	uint32_t db_card_type_2;	// 1:ante 2:cardstealer 3:counter 4:directdamage 5:discard 6:drawer 7:lifegain 8:damageprevention 9:anti-land 10:manasource 11:bounce/untap/tap 12:pump
	uint32_t rarity;	// 1:common 2:rare 3:dungeon/astral/promotional 4:uncommon (sic)
	uint8_t req_colorless;
	uint8_t req_black;
	uint8_t req_blue;
#ifdef SHANDALAR
	uint8_t req_hybrid;
	uint8_t hybrid_colors;
#else
	uint8_t unknown43;
	uint8_t unknown44;
#endif
	uint8_t req_green;
#ifdef SHANDALAR
	mana_flags_t mana_flags;
#else
	uint8_t unknown46;
#endif
	uint8_t req_red;
	uint8_t req_white;
	uint8_t unknown0x49[15];
	const char* artist;		// Always "None"
	uint32_t num_pics;
	const char* mana_cost_text;	// e.g. "|4|GU|GU"
	uint32_t ai_modifiers1;
	uint32_t ai_modifiers2;
	uint8_t ai_inc_power;
	uint8_t ai_inc_toughness;
	uint8_t ai_power;
	uint8_t ai_toughness;
	int16_t ai_base_value;
